espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_struct.h
// Copyright 2017-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include <stdint.h>

typedef volatile struct {
    union {
        struct {
            uint32_t in_rst_ch0:            1;                /*This bit is used to reset DMA channel 0 Rx FSM and Rx FIFO pointer.*/
            uint32_t out_rst_ch0:           1;                /*This bit is used to reset DMA channel 0 Tx FSM and Tx FIFO pointer.*/
            uint32_t in_loop_test_ch0:      1;                /*reserved*/
            uint32_t out_loop_test_ch0:     1;                /*reserved*/
            uint32_t out_auto_wrback_ch0:   1;                /*Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.*/
            uint32_t out_eof_mode_ch0:      1;                /*EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 0 is generated when data need to transmit has been popped from FIFO in DMA*/
            uint32_t outdscr_burst_en_ch0:  1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link descriptor when accessing internal SRAM.*/
            uint32_t indscr_burst_en_ch0:   1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link descriptor when accessing internal SRAM.*/
            uint32_t out_data_burst_en_ch0: 1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 0 transmitting data when accessing internal SRAM.*/
            uint32_t in_data_burst_en_ch0:  1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 0 receiving data when accessing internal SRAM.*/
            uint32_t mem_trans_en_ch0:      1;                /*Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.*/
            uint32_t reserved11:           21;                /*reserved*/
        };
        uint32_t val;
    } conf0_ch0;
    union {
        struct {
            uint32_t in_rst_ch1:            1;                /*This bit is used to reset DMA channel 1 Rx FSM and Rx FIFO pointer.*/
            uint32_t out_rst_ch1:           1;                /*This bit is used to reset DMA channel 1 Tx FSM and Tx FIFO pointer.*/
            uint32_t in_loop_test_ch1:      1;                /*reserved*/
            uint32_t out_loop_test_ch1:     1;                /*reserved*/
            uint32_t out_auto_wrback_ch1:   1;                /*Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.*/
            uint32_t out_eof_mode_ch1:      1;                /*EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 1 is generated when data need to transmit has been popped from FIFO in DMA*/
            uint32_t outdscr_burst_en_ch1:  1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 1 reading link descriptor when accessing internal SRAM.*/
            uint32_t indscr_burst_en_ch1:   1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 1 reading link descriptor when accessing internal SRAM.*/
            uint32_t out_data_burst_en_ch1: 1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 1 transmitting data when accessing internal SRAM.*/
            uint32_t in_data_burst_en_ch1:  1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 1 receiving data when accessing internal SRAM.*/
            uint32_t mem_trans_en_ch1:      1;                /*Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.*/
            uint32_t reserved11:           21;                /*reserved*/
        };
        uint32_t val;
    } conf0_ch1;
    union {
        struct {
            uint32_t in_rst_ch2:            1;                /*This bit is used to reset DMA channel 2 Rx FSM and Rx FIFO pointer.*/
            uint32_t out_rst_ch2:           1;                /*This bit is used to reset DMA channel 2 Tx FSM and Tx FIFO pointer.*/
            uint32_t in_loop_test_ch2:      1;                /*reserved*/
            uint32_t out_loop_test_ch2:     1;                /*reserved*/
            uint32_t out_auto_wrback_ch2:   1;                /*Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.*/
            uint32_t out_eof_mode_ch2:      1;                /*EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 2 is generated when data need to transmit has been popped from FIFO in DMA*/
            uint32_t outdscr_burst_en_ch2:  1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 2 reading link descriptor when accessing internal SRAM.*/
            uint32_t indscr_burst_en_ch2:   1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 2 reading link descriptor when accessing internal SRAM.*/
            uint32_t out_data_burst_en_ch2: 1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 2 transmitting data when accessing internal SRAM.*/
            uint32_t in_data_burst_en_ch2:  1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 2 receiving data when accessing internal SRAM.*/
            uint32_t mem_trans_en_ch2:      1;                /*Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.*/
            uint32_t reserved11:           21;                /*reserved*/
        };
        uint32_t val;
    } conf0_ch2;
    union {
        struct {
            uint32_t in_rst_ch3:            1;                /*This bit is used to reset DMA channel 3 Rx FSM and Rx FIFO pointer.*/
            uint32_t out_rst_ch3:           1;                /*This bit is used to reset DMA channel 3 Tx FSM and Tx FIFO pointer.*/
            uint32_t in_loop_test_ch3:      1;                /*reserved*/
            uint32_t out_loop_test_ch3:     1;                /*reserved*/
            uint32_t out_auto_wrback_ch3:   1;                /*Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.*/
            uint32_t out_eof_mode_ch3:      1;                /*EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 3 is generated when data need to transmit has been popped from FIFO in DMA*/
            uint32_t outdscr_burst_en_ch3:  1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 3 reading link descriptor when accessing internal SRAM.*/
            uint32_t indscr_burst_en_ch3:   1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 3 reading link descriptor when accessing internal SRAM.*/
            uint32_t out_data_burst_en_ch3: 1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 3 transmitting data when accessing internal SRAM.*/
            uint32_t in_data_burst_en_ch3:  1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 3 receiving data when accessing internal SRAM.*/
            uint32_t mem_trans_en_ch3:      1;                /*Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.*/
            uint32_t reserved11:           21;                /*reserved*/
        };
        uint32_t val;
    } conf0_ch3;
    union {
        struct {
            uint32_t in_rst_ch4:            1;                /*This bit is used to reset DMA channel 4 Rx FSM and Rx FIFO pointer.*/
            uint32_t out_rst_ch4:           1;                /*This bit is used to reset DMA channel 4 Tx FSM and Tx FIFO pointer.*/
            uint32_t in_loop_test_ch4:      1;                /*reserved*/
            uint32_t out_loop_test_ch4:     1;                /*reserved*/
            uint32_t out_auto_wrback_ch4:   1;                /*Set this bit to enable automatic outlink-writeback when all the data in tx buffer has been transmitted.*/
            uint32_t out_eof_mode_ch4:      1;                /*EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 4 is generated when data need to transmit has been popped from FIFO in DMA*/
            uint32_t outdscr_burst_en_ch4:  1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 4 reading link descriptor when accessing internal SRAM.*/
            uint32_t indscr_burst_en_ch4:   1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 4 reading link descriptor when accessing internal SRAM.*/
            uint32_t out_data_burst_en_ch4: 1;                /*Set this bit to 1 to enable INCR burst transfer for Tx channel 4 transmitting data when accessing internal SRAM.*/
            uint32_t in_data_burst_en_ch4:  1;                /*Set this bit to 1 to enable INCR burst transfer for Rx channel 4 receiving data when accessing internal SRAM.*/
            uint32_t mem_trans_en_ch4:      1;                /*Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.*/
            uint32_t reserved11:           21;                /*reserved*/
        };
        uint32_t val;
    } conf0_ch4;
    union {
        struct {
            uint32_t infifo_full_thrs_ch0:   12;              /*This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx channel 0 received byte number in Rx FIFO is up to the value of the register.*/
            uint32_t check_owner_ch0:         1;              /*Set this bit to enable checking the owner attribute of the link descriptor.*/
            uint32_t in_ext_mem_bk_size_ch0:  2;              /*Block size of Rx channel 0 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t out_ext_mem_bk_size_ch0: 2;              /*Block size of Tx channel 0 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t reserved17:             15;              /*reserved*/
        };
        uint32_t val;
    } conf1_ch0;
    union {
        struct {
            uint32_t infifo_full_thrs_ch1:   12;              /*This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx channel 1 received byte number in Rx FIFO is up to the value of the register.*/
            uint32_t check_owner_ch1:         1;              /*Set this bit to enable checking the owner attribute of the link descriptor.*/
            uint32_t in_ext_mem_bk_size_ch1:  2;              /*Block size of Rx channel 1 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t out_ext_mem_bk_size_ch1: 2;              /*Block size of Tx channel 1 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t reserved17:             15;              /*reserved*/
        };
        uint32_t val;
    } conf1_ch1;
    union {
        struct {
            uint32_t infifo_full_thrs_ch2:   12;              /*This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx channel 2 received byte number in Rx FIFO is up to the value of the register.*/
            uint32_t check_owner_ch2:         1;              /*Set this bit to enable checking the owner attribute of the link descriptor.*/
            uint32_t in_ext_mem_bk_size_ch2:  2;              /*Block size of Rx channel 2 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t out_ext_mem_bk_size_ch2: 2;              /*Block size of Tx channel 2 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t reserved17:             15;              /*reserved*/
        };
        uint32_t val;
    } conf1_ch2;
    union {
        struct {
            uint32_t infifo_full_thrs_ch3:   12;              /*This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx channel 3 received byte number in Rx FIFO is up to the value of the register.*/
            uint32_t check_owner_ch3:         1;              /*Set this bit to enable checking the owner attribute of the link descriptor.*/
            uint32_t in_ext_mem_bk_size_ch3:  2;              /*Block size of Rx channel 3 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t out_ext_mem_bk_size_ch3: 2;              /*Block size of Tx channel 3 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t reserved17:             15;              /*reserved*/
        };
        uint32_t val;
    } conf1_ch3;
    union {
        struct {
            uint32_t infifo_full_thrs_ch4:   12;              /*This register is used to generate the INFIFO_FULL_WM_INT interrupt when Rx channel 4 received byte number in Rx FIFO is up to the value of the register.*/
            uint32_t check_owner_ch4:         1;              /*Set this bit to enable checking the owner attribute of the link descriptor.*/
            uint32_t in_ext_mem_bk_size_ch4:  2;              /*Block size of Rx channel 4 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t out_ext_mem_bk_size_ch4: 2;              /*Block size of Tx channel 4 when DMA access external SRAM. 0: 16 bytes      1: 32 bytes    2/3:reserved*/
            uint32_t reserved17:             15;              /*reserved*/
        };
        uint32_t val;
    } conf1_ch4;
    union {
        struct {
            uint32_t in_done_ch0:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 0.*/
            uint32_t in_suc_eof_ch0:             1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 0. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 0.*/
            uint32_t in_err_eof_ch0:             1;           /*The raw interrupt bit turns to high level when data error is detected only in the case that the peripheral is UHCI0 for Rx channel 0. For other peripherals  this raw interrupt is reserved.*/
            uint32_t out_done_ch0:               1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 0.*/
            uint32_t out_eof_ch0:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 0.*/
            uint32_t in_dscr_err_ch0:            1;           /*The raw interrupt bit turns to high level when detecting inlink descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 0.*/
            uint32_t out_dscr_err_ch0:           1;           /*The raw interrupt bit turns to high level when detecting outlink descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 0.*/
            uint32_t in_dscr_empty_ch0:          1;           /*The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 0.*/
            uint32_t out_total_eof_ch0:          1;           /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 0.*/
            uint32_t infifo_full_wm_ch0:         1;           /*The raw interrupt bit turns to high level when received data byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 0.*/
            uint32_t infifo_ovf_l1_ch0:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is overflow.*/
            uint32_t infifo_udf_l1_ch0:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 0 is underflow.*/
            uint32_t infifo_ovf_l3_ch0:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 0 is overflow.*/
            uint32_t infifo_udf_l3_ch0:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 0 is underflow.*/
            uint32_t outfifo_ovf_l1_ch0:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is overflow.*/
            uint32_t outfifo_udf_l1_ch0:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 0 is underflow.*/
            uint32_t outfifo_ovf_l3_ch0:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is overflow.*/
            uint32_t outfifo_udf_l3_ch0:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 0 is underflow.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_raw_ch0;
    union {
        struct {
            uint32_t in_done_ch1:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 1.*/
            uint32_t in_suc_eof_ch1:             1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 1. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 1.*/
            uint32_t in_err_eof_ch1:             1;           /*The raw interrupt bit turns to high level when data error is detected only in the case that the peripheral is UHCI0 for Rx channel 1. For other peripherals  this raw interrupt is reserved.*/
            uint32_t out_done_ch1:               1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 1.*/
            uint32_t out_eof_ch1:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 1.*/
            uint32_t in_dscr_err_ch1:            1;           /*The raw interrupt bit turns to high level when detecting inlink descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 1.*/
            uint32_t out_dscr_err_ch1:           1;           /*The raw interrupt bit turns to high level when detecting outlink descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 1.*/
            uint32_t in_dscr_empty_ch1:          1;           /*The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 1.*/
            uint32_t out_total_eof_ch1:          1;           /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 1.*/
            uint32_t infifo_full_wm_ch1:         1;           /*The raw interrupt bit turns to high level when received data byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 1.*/
            uint32_t infifo_ovf_l1_ch1:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 1 is overflow.*/
            uint32_t infifo_udf_l1_ch1:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 1 is underflow.*/
            uint32_t infifo_ovf_l3_ch1:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 1 is overflow.*/
            uint32_t infifo_udf_l3_ch1:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 1 is underflow.*/
            uint32_t outfifo_ovf_l1_ch1:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 1 is overflow.*/
            uint32_t outfifo_udf_l1_ch1:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 1 is underflow.*/
            uint32_t outfifo_ovf_l3_ch1:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 1 is overflow.*/
            uint32_t outfifo_udf_l3_ch1:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 1 is underflow.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_raw_ch1;
    union {
        struct {
            uint32_t in_done_ch2:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 2.*/
            uint32_t in_suc_eof_ch2:             1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 2. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 2.*/
            uint32_t in_err_eof_ch2:             1;           /*The raw interrupt bit turns to high level when data error is detected only in the case that the peripheral is UHCI0 for Rx channel 2. For other peripherals  this raw interrupt is reserved.*/
            uint32_t out_done_ch2:               1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 2.*/
            uint32_t out_eof_ch2:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 2.*/
            uint32_t in_dscr_err_ch2:            1;           /*The raw interrupt bit turns to high level when detecting inlink descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 2.*/
            uint32_t out_dscr_err_ch2:           1;           /*The raw interrupt bit turns to high level when detecting outlink descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 2.*/
            uint32_t in_dscr_empty_ch2:          1;           /*The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 2.*/
