espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_struct.h
            uint32_t out_total_eof_ch2:          1;           /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 2.*/
            uint32_t infifo_full_wm_ch2:         1;           /*The raw interrupt bit turns to high level when received data byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 2.*/
            uint32_t infifo_ovf_l1_ch2:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 2 is overflow.*/
            uint32_t infifo_udf_l1_ch2:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 2 is underflow.*/
            uint32_t infifo_ovf_l3_ch2:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 2 is overflow.*/
            uint32_t infifo_udf_l3_ch2:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 2 is underflow.*/
            uint32_t outfifo_ovf_l1_ch2:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 2 is overflow.*/
            uint32_t outfifo_udf_l1_ch2:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 2 is underflow.*/
            uint32_t outfifo_ovf_l3_ch2:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 2 is overflow.*/
            uint32_t outfifo_udf_l3_ch2:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 2 is underflow.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_raw_ch2;
    union {
        struct {
            uint32_t in_done_ch3:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 3.*/
            uint32_t in_suc_eof_ch3:             1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 3. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 3.*/
            uint32_t in_err_eof_ch3:             1;           /*The raw interrupt bit turns to high level when data error is detected only in the case that the peripheral is UHCI0 for Rx channel 3. For other peripherals  this raw interrupt is reserved.*/
            uint32_t out_done_ch3:               1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 3.*/
            uint32_t out_eof_ch3:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 3.*/
            uint32_t in_dscr_err_ch3:            1;           /*The raw interrupt bit turns to high level when detecting inlink descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 3.*/
            uint32_t out_dscr_err_ch3:           1;           /*The raw interrupt bit turns to high level when detecting outlink descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 3.*/
            uint32_t in_dscr_empty_ch3:          1;           /*The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 3.*/
            uint32_t out_total_eof_ch3:          1;           /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 3.*/
            uint32_t infifo_full_wm_ch3:         1;           /*The raw interrupt bit turns to high level when received data byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 3.*/
            uint32_t infifo_ovf_l1_ch3:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 3 is overflow.*/
            uint32_t infifo_udf_l1_ch3:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 3 is underflow.*/
            uint32_t infifo_ovf_l3_ch3:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 3 is overflow.*/
            uint32_t infifo_udf_l3_ch3:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 3 is underflow.*/
            uint32_t outfifo_ovf_l1_ch3:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 3 is overflow.*/
            uint32_t outfifo_udf_l1_ch3:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 3 is underflow.*/
            uint32_t outfifo_ovf_l3_ch3:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 3 is overflow.*/
            uint32_t outfifo_udf_l3_ch3:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 3 is underflow.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_raw_ch3;
    union {
        struct {
            uint32_t in_done_ch4:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 4.*/
            uint32_t in_suc_eof_ch4:             1;           /*The raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received for Rx channel 4. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 4.*/
            uint32_t in_err_eof_ch4:             1;           /*The raw interrupt bit turns to high level when data error is detected only in the case that the peripheral is UHCI0 for Rx channel 4. For other peripherals  this raw interrupt is reserved.*/
            uint32_t out_done_ch4:               1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 4.*/
            uint32_t out_eof_ch4:                1;           /*The raw interrupt bit turns to high level when the last data pointed by one outlink descriptor has been read from memory for Tx channel 4.*/
            uint32_t in_dscr_err_ch4:            1;           /*The raw interrupt bit turns to high level when detecting inlink descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 4.*/
            uint32_t out_dscr_err_ch4:           1;           /*The raw interrupt bit turns to high level when detecting outlink descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 4.*/
            uint32_t in_dscr_empty_ch4:          1;           /*The raw interrupt bit turns to high level when Rx buffer pointed by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 4.*/
            uint32_t out_total_eof_ch4:          1;           /*The raw interrupt bit turns to high level when data corresponding a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 4.*/
            uint32_t infifo_full_wm_ch4:         1;           /*The raw interrupt bit turns to high level when received data byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 4.*/
            uint32_t infifo_ovf_l1_ch4:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 4 is overflow.*/
            uint32_t infifo_udf_l1_ch4:          1;           /*This raw interrupt bit turns to high level when level 1 fifo of Rx channel 4 is underflow.*/
            uint32_t infifo_ovf_l3_ch4:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 4 is overflow.*/
            uint32_t infifo_udf_l3_ch4:          1;           /*This raw interrupt bit turns to high level when level 3 fifo of Rx channel 4 is underflow.*/
            uint32_t outfifo_ovf_l1_ch4:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 4 is overflow.*/
            uint32_t outfifo_udf_l1_ch4:         1;           /*This raw interrupt bit turns to high level when level 1 fifo of Tx channel 4 is underflow.*/
            uint32_t outfifo_ovf_l3_ch4:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 4 is overflow.*/
            uint32_t outfifo_udf_l3_ch4:         1;           /*This raw interrupt bit turns to high level when level 3 fifo of Tx channel 4 is underflow.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_raw_ch4;
    uint32_t reserved_3c;
    union {
        struct {
            uint32_t in_done_ch0:               1;            /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch0:            1;            /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch0:            1;            /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch0:              1;            /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch0:               1;            /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch0:           1;            /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch0:          1;            /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch0:         1;            /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch0:         1;            /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch0:        1;            /*The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch0:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch0:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch0:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch0:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch0:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch0:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch0:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch0:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:               14;            /*reserved*/
        };
        uint32_t val;
    } int_st_ch0;
    union {
        struct {
            uint32_t in_done_ch1:               1;            /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch1:            1;            /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch1:            1;            /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch1:              1;            /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch1:               1;            /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch1:           1;            /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch1:          1;            /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch1:         1;            /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch1:         1;            /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch1:        1;            /*The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch1:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch1:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch1:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch1:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch1:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch1:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch1:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch1:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:               14;            /*reserved*/
        };
        uint32_t val;
    } int_st_ch1;
    union {
        struct {
            uint32_t in_done_ch2:               1;            /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch2:            1;            /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch2:            1;            /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch2:              1;            /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch2:               1;            /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch2:           1;            /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch2:          1;            /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch2:         1;            /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch2:         1;            /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch2:        1;            /*The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch2:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch2:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch2:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch2:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch2:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch2:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch2:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch2:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:               14;            /*reserved*/
        };
        uint32_t val;
    } int_st_ch2;
    union {
        struct {
            uint32_t in_done_ch3:               1;            /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch3:            1;            /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch3:            1;            /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch3:              1;            /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch3:               1;            /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch3:           1;            /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch3:          1;            /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch3:         1;            /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch3:         1;            /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch3:        1;            /*The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch3:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch3:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch3:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch3:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch3:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch3:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch3:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch3:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:               14;            /*reserved*/
        };
        uint32_t val;
    } int_st_ch3;
    union {
        struct {
            uint32_t in_done_ch4:               1;            /*The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch4:            1;            /*The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch4:            1;            /*The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch4:              1;            /*The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch4:               1;            /*The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch4:           1;            /*The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch4:          1;            /*The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch4:         1;            /*The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch4:         1;            /*The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch4:        1;            /*The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch4:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch4:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch4:         1;            /*The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch4:         1;            /*The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch4:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch4:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch4:        1;            /*The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch4:        1;            /*The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:               14;            /*reserved*/
        };
        uint32_t val;
    } int_st_ch4;
    union {
        struct {
            uint32_t in_done_ch0:                1;           /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch0:             1;           /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch0:             1;           /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch0:               1;           /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch0:                1;           /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch0:            1;           /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch0:           1;           /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch0:          1;           /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch0:          1;           /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch0:         1;           /*The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch0:          1;           /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch0:          1;           /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
