espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_struct.h
            uint32_t infifo_ovf_l3_ch0:          1;           /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch0:          1;           /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch0:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch0:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch0:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch0:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_ena_ch0;
    union {
        struct {
            uint32_t in_done_ch1:                1;           /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch1:             1;           /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch1:             1;           /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch1:               1;           /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch1:                1;           /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch1:            1;           /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch1:           1;           /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch1:          1;           /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch1:          1;           /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch1:         1;           /*The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch1:          1;           /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch1:          1;           /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch1:          1;           /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch1:          1;           /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch1:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch1:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch1:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch1:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_ena_ch1;
    union {
        struct {
            uint32_t in_done_ch2:                1;           /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch2:             1;           /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch2:             1;           /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch2:               1;           /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch2:                1;           /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch2:            1;           /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch2:           1;           /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch2:          1;           /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch2:          1;           /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch2:         1;           /*The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch2:          1;           /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch2:          1;           /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch2:          1;           /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch2:          1;           /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch2:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch2:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch2:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch2:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_ena_ch2;
    union {
        struct {
            uint32_t in_done_ch3:                1;           /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch3:             1;           /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch3:             1;           /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch3:               1;           /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch3:                1;           /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch3:            1;           /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch3:           1;           /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch3:          1;           /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch3:          1;           /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch3:         1;           /*The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch3:          1;           /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch3:          1;           /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch3:          1;           /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch3:          1;           /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch3:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch3:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch3:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch3:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_ena_ch3;
    union {
        struct {
            uint32_t in_done_ch4:                1;           /*The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch4:             1;           /*The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch4:             1;           /*The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch4:               1;           /*The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch4:                1;           /*The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch4:            1;           /*The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch4:           1;           /*The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch4:          1;           /*The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch4:          1;           /*The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch4:         1;           /*The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch4:          1;           /*The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch4:          1;           /*The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch4:          1;           /*The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch4:          1;           /*The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch4:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch4:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch4:         1;           /*The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch4:         1;           /*The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_ena_ch4;
    union {
        struct {
            uint32_t in_done_ch0:                1;           /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch0:             1;           /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch0:             1;           /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch0:               1;           /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch0:                1;           /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch0:            1;           /*Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch0:           1;           /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch0:          1;           /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch0:          1;           /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch0:         1;           /*Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch0:          1;           /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch0:          1;           /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch0:          1;           /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch0:          1;           /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch0:         1;           /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch0:         1;           /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch0:         1;           /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch0:         1;           /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_clr_ch0;
    union {
        struct {
            uint32_t in_done_ch1:                1;           /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch1:             1;           /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch1:             1;           /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch1:               1;           /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch1:                1;           /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch1:            1;           /*Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch1:           1;           /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch1:          1;           /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch1:          1;           /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch1:         1;           /*Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch1:          1;           /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch1:          1;           /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch1:          1;           /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch1:          1;           /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch1:         1;           /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch1:         1;           /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch1:         1;           /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch1:         1;           /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_clr_ch1;
    union {
        struct {
            uint32_t in_done_ch2:                1;           /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch2:             1;           /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch2:             1;           /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch2:               1;           /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch2:                1;           /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch2:            1;           /*Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch2:           1;           /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch2:          1;           /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch2:          1;           /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch2:         1;           /*Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch2:          1;           /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch2:          1;           /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch2:          1;           /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch2:          1;           /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch2:         1;           /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch2:         1;           /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch2:         1;           /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch2:         1;           /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_clr_ch2;
    union {
        struct {
            uint32_t in_done_ch3:                1;           /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch3:             1;           /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch3:             1;           /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch3:               1;           /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch3:                1;           /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch3:            1;           /*Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch3:           1;           /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch3:          1;           /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch3:          1;           /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch3:         1;           /*Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch3:          1;           /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch3:          1;           /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch3:          1;           /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch3:          1;           /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch3:         1;           /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch3:         1;           /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch3:         1;           /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch3:         1;           /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_clr_ch3;
    union {
        struct {
            uint32_t in_done_ch4:                1;           /*Set this bit to clear the IN_DONE_CH_INT interrupt.*/
            uint32_t in_suc_eof_ch4:             1;           /*Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
            uint32_t in_err_eof_ch4:             1;           /*Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
            uint32_t out_done_ch4:               1;           /*Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
            uint32_t out_eof_ch4:                1;           /*Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
            uint32_t in_dscr_err_ch4:            1;           /*Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
            uint32_t out_dscr_err_ch4:           1;           /*Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
            uint32_t in_dscr_empty_ch4:          1;           /*Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
            uint32_t out_total_eof_ch4:          1;           /*Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
            uint32_t infifo_full_wm_ch4:         1;           /*Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
            uint32_t infifo_ovf_l1_ch4:          1;           /*Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t infifo_udf_l1_ch4:          1;           /*Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t infifo_ovf_l3_ch4:          1;           /*Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t infifo_udf_l3_ch4:          1;           /*Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l1_ch4:         1;           /*Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
            uint32_t outfifo_udf_l1_ch4:         1;           /*Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
            uint32_t outfifo_ovf_l3_ch4:         1;           /*Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
            uint32_t outfifo_udf_l3_ch4:         1;           /*Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
            uint32_t reserved18:                14;           /*reserved*/
        };
        uint32_t val;
    } int_clr_ch4;
    union {
        struct {
            uint32_t infifo_full_l1_ch0:        1;            /*L1 Rx FIFO full signal for Rx channel 0.*/
            uint32_t infifo_empty_l1_ch0:       1;            /*L1 Rx FIFO empty signal for Rx channel 0.*/
            uint32_t infifo_full_l2_ch0:        1;            /*L2 Rx FIFO full signal for Rx channel 0.*/
            uint32_t infifo_empty_l2_ch0:       1;            /*L2 Rx FIFO empty signal for Rx channel 0.*/
            uint32_t infifo_full_l3_ch0:        1;            /*L3 Rx FIFO full signal for Rx channel 0.*/
            uint32_t infifo_empty_l3_ch0:       1;            /*L3 Rx FIFO empty signal for Rx channel 0.*/
            uint32_t infifo_cnt_l1_ch0:         5;            /*The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.*/
            uint32_t infifo_cnt_l2_ch0:         7;            /*The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.*/
            uint32_t infifo_cnt_l3_ch0:         5;            /*The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.*/
            uint32_t in_remain_under_1b_l3_ch0: 1;            /*reserved*/
            uint32_t in_remain_under_2b_l3_ch0: 1;            /*reserved*/
