espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_struct.h
            uint32_t in_remain_under_3b_l3_ch0: 1;            /*reserved*/
            uint32_t in_remain_under_4b_l3_ch0: 1;            /*reserved*/
            uint32_t in_buf_hungry_ch0:         1;            /*reserved*/
            uint32_t reserved28:                4;            /*reserved*/
        };
        uint32_t val;
    } infifo_status_ch0;
    union {
        struct {
            uint32_t infifo_full_l1_ch1:        1;            /*L1 Rx FIFO full signal for Rx channel 1.*/
            uint32_t infifo_empty_l1_ch1:       1;            /*L1 Rx FIFO empty signal for Rx channel 1.*/
            uint32_t infifo_full_l2_ch1:        1;            /*L2 Rx FIFO full signal for Rx channel 1.*/
            uint32_t infifo_empty_l2_ch1:       1;            /*L2 Rx FIFO empty signal for Rx channel 1.*/
            uint32_t infifo_full_l3_ch1:        1;            /*L3 Rx FIFO full signal for Rx channel 1.*/
            uint32_t infifo_empty_l3_ch1:       1;            /*L3 Rx FIFO empty signal for Rx channel 1.*/
            uint32_t infifo_cnt_l1_ch1:         5;            /*The register stores the byte number of the data in L1 Rx FIFO for Rx channel 1.*/
            uint32_t infifo_cnt_l2_ch1:         7;            /*The register stores the byte number of the data in L2 Rx FIFO for Rx channel 1.*/
            uint32_t infifo_cnt_l3_ch1:         5;            /*The register stores the byte number of the data in L3 Rx FIFO for Rx channel 1.*/
            uint32_t in_remain_under_1b_l3_ch1: 1;            /*reserved*/
            uint32_t in_remain_under_2b_l3_ch1: 1;            /*reserved*/
            uint32_t in_remain_under_3b_l3_ch1: 1;            /*reserved*/
            uint32_t in_remain_under_4b_l3_ch1: 1;            /*reserved*/
            uint32_t in_buf_hungry_ch1:         1;            /*reserved*/
            uint32_t reserved28:                4;            /*reserved*/
        };
        uint32_t val;
    } infifo_status_ch1;
    union {
        struct {
            uint32_t infifo_full_l1_ch2:        1;            /*L1 Rx FIFO full signal for Rx channel 2.*/
            uint32_t infifo_empty_l1_ch2:       1;            /*L1 Rx FIFO empty signal for Rx channel 2.*/
            uint32_t infifo_full_l2_ch2:        1;            /*L2 Rx FIFO full signal for Rx channel 2.*/
            uint32_t infifo_empty_l2_ch2:       1;            /*L2 Rx FIFO empty signal for Rx channel 2.*/
            uint32_t infifo_full_l3_ch2:        1;            /*L3 Rx FIFO full signal for Rx channel 2.*/
            uint32_t infifo_empty_l3_ch2:       1;            /*L3 Rx FIFO empty signal for Rx channel 2.*/
            uint32_t infifo_cnt_l1_ch2:         5;            /*The register stores the byte number of the data in L1 Rx FIFO for Rx channel 2.*/
            uint32_t infifo_cnt_l2_ch2:         7;            /*The register stores the byte number of the data in L2 Rx FIFO for Rx channel 2.*/
            uint32_t infifo_cnt_l3_ch2:         5;            /*The register stores the byte number of the data in L3 Rx FIFO for Rx channel 2.*/
            uint32_t in_remain_under_1b_l3_ch2: 1;            /*reserved*/
            uint32_t in_remain_under_2b_l3_ch2: 1;            /*reserved*/
            uint32_t in_remain_under_3b_l3_ch2: 1;            /*reserved*/
            uint32_t in_remain_under_4b_l3_ch2: 1;            /*reserved*/
            uint32_t in_buf_hungry_ch2:         1;            /*reserved*/
            uint32_t reserved28:                4;            /*reserved*/
        };
        uint32_t val;
    } infifo_status_ch2;
    union {
        struct {
            uint32_t infifo_full_l1_ch3:        1;            /*L1 Rx FIFO full signal for Rx channel 3.*/
            uint32_t infifo_empty_l1_ch3:       1;            /*L1 Rx FIFO empty signal for Rx channel 3.*/
            uint32_t infifo_full_l2_ch3:        1;            /*L2 Rx FIFO full signal for Rx channel 3.*/
            uint32_t infifo_empty_l2_ch3:       1;            /*L2 Rx FIFO empty signal for Rx channel 3.*/
            uint32_t infifo_full_l3_ch3:        1;            /*L3 Rx FIFO full signal for Rx channel 3.*/
            uint32_t infifo_empty_l3_ch3:       1;            /*L3 Rx FIFO empty signal for Rx channel 3.*/
            uint32_t infifo_cnt_l1_ch3:         5;            /*The register stores the byte number of the data in L1 Rx FIFO for Rx channel 3.*/
            uint32_t infifo_cnt_l2_ch3:         7;            /*The register stores the byte number of the data in L2 Rx FIFO for Rx channel 3.*/
            uint32_t infifo_cnt_l3_ch3:         5;            /*The register stores the byte number of the data in L3 Rx FIFO for Rx channel 3.*/
            uint32_t in_remain_under_1b_l3_ch3: 1;            /*reserved*/
            uint32_t in_remain_under_2b_l3_ch3: 1;            /*reserved*/
            uint32_t in_remain_under_3b_l3_ch3: 1;            /*reserved*/
            uint32_t in_remain_under_4b_l3_ch3: 1;            /*reserved*/
            uint32_t in_buf_hungry_ch3:         1;            /*reserved*/
            uint32_t reserved28:                4;            /*reserved*/
        };
        uint32_t val;
    } infifo_status_ch3;
    union {
        struct {
            uint32_t infifo_full_l1_ch4:        1;            /*L1 Rx FIFO full signal for Rx channel 4.*/
            uint32_t infifo_empty_l1_ch4:       1;            /*L1 Rx FIFO empty signal for Rx channel 4.*/
            uint32_t infifo_full_l2_ch4:        1;            /*L2 Rx FIFO full signal for Rx channel 4.*/
            uint32_t infifo_empty_l2_ch4:       1;            /*L2 Rx FIFO empty signal for Rx channel 4.*/
            uint32_t infifo_full_l3_ch4:        1;            /*L3 Rx FIFO full signal for Rx channel 4.*/
            uint32_t infifo_empty_l3_ch4:       1;            /*L3 Rx FIFO empty signal for Rx channel 4.*/
            uint32_t infifo_cnt_l1_ch4:         5;            /*The register stores the byte number of the data in L1 Rx FIFO for Rx channel 4.*/
            uint32_t infifo_cnt_l2_ch4:         7;            /*The register stores the byte number of the data in L2 Rx FIFO for Rx channel 4.*/
            uint32_t infifo_cnt_l3_ch4:         5;            /*The register stores the byte number of the data in L3 Rx FIFO for Rx channel 4.*/
            uint32_t in_remain_under_1b_l3_ch4: 1;            /*reserved*/
            uint32_t in_remain_under_2b_l3_ch4: 1;            /*reserved*/
            uint32_t in_remain_under_3b_l3_ch4: 1;            /*reserved*/
            uint32_t in_remain_under_4b_l3_ch4: 1;            /*reserved*/
            uint32_t in_buf_hungry_ch4:         1;            /*reserved*/
            uint32_t reserved28:                4;            /*reserved*/
        };
        uint32_t val;
    } infifo_status_ch4;
    union {
        struct {
            uint32_t outfifo_full_l1_ch0:        1;           /*L1 Tx FIFO full signal for Tx channel 0.*/
            uint32_t outfifo_empty_l1_ch0:       1;           /*L1 Tx FIFO empty signal for Tx channel 0.*/
            uint32_t outfifo_full_l2_ch0:        1;           /*L2 Tx FIFO full signal for Tx channel 0.*/
            uint32_t outfifo_empty_l2_ch0:       1;           /*L2 Tx FIFO empty signal for Tx channel 0.*/
            uint32_t outfifo_full_l3_ch0:        1;           /*L3 Tx FIFO full signal for Tx channel 0.*/
            uint32_t outfifo_empty_l3_ch0:       1;           /*L3 Tx FIFO empty signal for Tx channel 0.*/
            uint32_t outfifo_cnt_l1_ch0:         5;           /*The register stores the byte number of the data in L1 Tx FIFO for Tx channel 0.*/
            uint32_t outfifo_cnt_l2_ch0:         7;           /*The register stores the byte number of the data in L2 Tx FIFO for Tx channel 0.*/
            uint32_t outfifo_cnt_l3_ch0:         5;           /*The register stores the byte number of the data in L3 Tx FIFO for Tx channel 0.*/
            uint32_t out_remain_under_1b_l3_ch0: 1;           /*reserved*/
            uint32_t out_remain_under_2b_l3_ch0: 1;           /*reserved*/
            uint32_t out_remain_under_3b_l3_ch0: 1;           /*reserved*/
            uint32_t out_remain_under_4b_l3_ch0: 1;           /*reserved*/
            uint32_t reserved27:                 5;           /*reserved*/
        };
        uint32_t val;
    } outfifo_status_ch0;
    union {
        struct {
            uint32_t outfifo_full_l1_ch1:        1;           /*L1 Tx FIFO full signal for Tx channel 1.*/
            uint32_t outfifo_empty_l1_ch1:       1;           /*L1 Tx FIFO empty signal for Tx channel 1.*/
            uint32_t outfifo_full_l2_ch1:        1;           /*L2 Tx FIFO full signal for Tx channel 1.*/
            uint32_t outfifo_empty_l2_ch1:       1;           /*L2 Tx FIFO empty signal for Tx channel 1.*/
            uint32_t outfifo_full_l3_ch1:        1;           /*L3 Tx FIFO full signal for Tx channel 1.*/
            uint32_t outfifo_empty_l3_ch1:       1;           /*L3 Tx FIFO empty signal for Tx channel 1.*/
            uint32_t outfifo_cnt_l1_ch1:         5;           /*The register stores the byte number of the data in L1 Tx FIFO for Tx channel 1.*/
            uint32_t outfifo_cnt_l2_ch1:         7;           /*The register stores the byte number of the data in L2 Tx FIFO for Tx channel 1.*/
            uint32_t outfifo_cnt_l3_ch1:         5;           /*The register stores the byte number of the data in L3 Tx FIFO for Tx channel 1.*/
            uint32_t out_remain_under_1b_l3_ch1: 1;           /*reserved*/
            uint32_t out_remain_under_2b_l3_ch1: 1;           /*reserved*/
            uint32_t out_remain_under_3b_l3_ch1: 1;           /*reserved*/
            uint32_t out_remain_under_4b_l3_ch1: 1;           /*reserved*/
            uint32_t reserved27:                 5;           /*reserved*/
        };
        uint32_t val;
    } outfifo_status_ch1;
    union {
        struct {
            uint32_t outfifo_full_l1_ch2:        1;           /*L1 Tx FIFO full signal for Tx channel 2.*/
            uint32_t outfifo_empty_l1_ch2:       1;           /*L1 Tx FIFO empty signal for Tx channel 2.*/
            uint32_t outfifo_full_l2_ch2:        1;           /*L2 Tx FIFO full signal for Tx channel 2.*/
            uint32_t outfifo_empty_l2_ch2:       1;           /*L2 Tx FIFO empty signal for Tx channel 2.*/
            uint32_t outfifo_full_l3_ch2:        1;           /*L3 Tx FIFO full signal for Tx channel 2.*/
            uint32_t outfifo_empty_l3_ch2:       1;           /*L3 Tx FIFO empty signal for Tx channel 2.*/
            uint32_t outfifo_cnt_l1_ch2:         5;           /*The register stores the byte number of the data in L1 Tx FIFO for Tx channel 2.*/
            uint32_t outfifo_cnt_l2_ch2:         7;           /*The register stores the byte number of the data in L2 Tx FIFO for Tx channel 2.*/
            uint32_t outfifo_cnt_l3_ch2:         5;           /*The register stores the byte number of the data in L3 Tx FIFO for Tx channel 2.*/
            uint32_t out_remain_under_1b_l3_ch2: 1;           /*reserved*/
            uint32_t out_remain_under_2b_l3_ch2: 1;           /*reserved*/
            uint32_t out_remain_under_3b_l3_ch2: 1;           /*reserved*/
            uint32_t out_remain_under_4b_l3_ch2: 1;           /*reserved*/
            uint32_t reserved27:                 5;           /*reserved*/
        };
        uint32_t val;
    } outfifo_status_ch2;
    union {
        struct {
            uint32_t outfifo_full_l1_ch3:        1;           /*L1 Tx FIFO full signal for Tx channel 3.*/
            uint32_t outfifo_empty_l1_ch3:       1;           /*L1 Tx FIFO empty signal for Tx channel 3.*/
            uint32_t outfifo_full_l2_ch3:        1;           /*L2 Tx FIFO full signal for Tx channel 3.*/
            uint32_t outfifo_empty_l2_ch3:       1;           /*L2 Tx FIFO empty signal for Tx channel 3.*/
            uint32_t outfifo_full_l3_ch3:        1;           /*L3 Tx FIFO full signal for Tx channel 3.*/
            uint32_t outfifo_empty_l3_ch3:       1;           /*L3 Tx FIFO empty signal for Tx channel 3.*/
            uint32_t outfifo_cnt_l1_ch3:         5;           /*The register stores the byte number of the data in L1 Tx FIFO for Tx channel 3.*/
            uint32_t outfifo_cnt_l2_ch3:         7;           /*The register stores the byte number of the data in L2 Tx FIFO for Tx channel 3.*/
            uint32_t outfifo_cnt_l3_ch3:         5;           /*The register stores the byte number of the data in L3 Tx FIFO for Tx channel 3.*/
            uint32_t out_remain_under_1b_l3_ch3: 1;           /*reserved*/
            uint32_t out_remain_under_2b_l3_ch3: 1;           /*reserved*/
            uint32_t out_remain_under_3b_l3_ch3: 1;           /*reserved*/
            uint32_t out_remain_under_4b_l3_ch3: 1;           /*reserved*/
            uint32_t reserved27:                 5;           /*reserved*/
        };
        uint32_t val;
    } outfifo_status_ch3;
    union {
        struct {
            uint32_t outfifo_full_l1_ch4:        1;           /*L1 Tx FIFO full signal for Tx channel 4.*/
            uint32_t outfifo_empty_l1_ch4:       1;           /*L1 Tx FIFO empty signal for Tx channel 4.*/
            uint32_t outfifo_full_l2_ch4:        1;           /*L2 Tx FIFO full signal for Tx channel 4.*/
            uint32_t outfifo_empty_l2_ch4:       1;           /*L2 Tx FIFO empty signal for Tx channel 4.*/
            uint32_t outfifo_full_l3_ch4:        1;           /*L3 Tx FIFO full signal for Tx channel 4.*/
            uint32_t outfifo_empty_l3_ch4:       1;           /*L3 Tx FIFO empty signal for Tx channel 4.*/
            uint32_t outfifo_cnt_l1_ch4:         5;           /*The register stores the byte number of the data in L1 Tx FIFO for Tx channel 4.*/
            uint32_t outfifo_cnt_l2_ch4:         7;           /*The register stores the byte number of the data in L2 Tx FIFO for Tx channel 4.*/
            uint32_t outfifo_cnt_l3_ch4:         5;           /*The register stores the byte number of the data in L3 Tx FIFO for Tx channel 4.*/
            uint32_t out_remain_under_1b_l3_ch4: 1;           /*reserved*/
            uint32_t out_remain_under_2b_l3_ch4: 1;           /*reserved*/
            uint32_t out_remain_under_3b_l3_ch4: 1;           /*reserved*/
            uint32_t out_remain_under_4b_l3_ch4: 1;           /*reserved*/
            uint32_t reserved27:                 5;           /*reserved*/
        };
        uint32_t val;
    } outfifo_status_ch4;
    union {
        struct {
            uint32_t outfifo_wdata_ch0: 9;                    /*This register stores the data that need to be pushed into DMA FIFO.*/
            uint32_t outfifo_push_ch0:  1;                    /*Set this bit to push data into DMA FIFO.*/
            uint32_t reserved10:       22;                    /*reserved*/
        };
        uint32_t val;
    } out_push_ch0;
    union {
        struct {
            uint32_t outfifo_wdata_ch1: 9;                    /*This register stores the data that need to be pushed into DMA FIFO.*/
            uint32_t outfifo_push_ch1:  1;                    /*Set this bit to push data into DMA FIFO.*/
            uint32_t reserved10:       22;                    /*reserved*/
        };
        uint32_t val;
    } out_push_ch1;
    union {
        struct {
            uint32_t outfifo_wdata_ch2: 9;                    /*This register stores the data that need to be pushed into DMA FIFO.*/
            uint32_t outfifo_push_ch2:  1;                    /*Set this bit to push data into DMA FIFO.*/
            uint32_t reserved10:       22;                    /*reserved*/
        };
        uint32_t val;
    } out_push_ch2;
    union {
        struct {
            uint32_t outfifo_wdata_ch3: 9;                    /*This register stores the data that need to be pushed into DMA FIFO.*/
            uint32_t outfifo_push_ch3:  1;                    /*Set this bit to push data into DMA FIFO.*/
            uint32_t reserved10:       22;                    /*reserved*/
        };
        uint32_t val;
    } out_push_ch3;
    union {
        struct {
            uint32_t outfifo_wdata_ch4: 9;                    /*This register stores the data that need to be pushed into DMA FIFO.*/
            uint32_t outfifo_push_ch4:  1;                    /*Set this bit to push data into DMA FIFO.*/
            uint32_t reserved10:       22;                    /*reserved*/
        };
        uint32_t val;
    } out_push_ch4;
    union {
        struct {
            uint32_t infifo_rdata_ch0: 12;                    /*This register stores the data popping from DMA FIFO.*/
            uint32_t infifo_pop_ch0:   1;                     /*Set this bit to pop data from DMA FIFO.*/
            uint32_t reserved13:      19;                     /*reserved*/
        };
        uint32_t val;
    } in_pop_ch0;
    union {
        struct {
            uint32_t infifo_rdata_ch1: 12;                    /*This register stores the data popping from DMA FIFO.*/
            uint32_t infifo_pop_ch1:   1;                     /*Set this bit to pop data from DMA FIFO.*/
            uint32_t reserved13:      19;                     /*reserved*/
        };
        uint32_t val;
    } in_pop_ch1;
    union {
        struct {
            uint32_t infifo_rdata_ch2: 12;                    /*This register stores the data popping from DMA FIFO.*/
            uint32_t infifo_pop_ch2:   1;                     /*Set this bit to pop data from DMA FIFO.*/
            uint32_t reserved13:      19;                     /*reserved*/
        };
        uint32_t val;
    } in_pop_ch2;
    union {
        struct {
            uint32_t infifo_rdata_ch3: 12;                    /*This register stores the data popping from DMA FIFO.*/
            uint32_t infifo_pop_ch3:   1;                     /*Set this bit to pop data from DMA FIFO.*/
            uint32_t reserved13:      19;                     /*reserved*/
        };
        uint32_t val;
    } in_pop_ch3;
    union {
        struct {
            uint32_t infifo_rdata_ch4: 12;                    /*This register stores the data popping from DMA FIFO.*/
            uint32_t infifo_pop_ch4:   1;                     /*Set this bit to pop data from DMA FIFO.*/
            uint32_t reserved13:      19;                     /*reserved*/
        };
        uint32_t val;
    } in_pop_ch4;
    union {
        struct {
            uint32_t outlink_addr_ch0:   20;                  /*This register stores the 20 least significant bits of the first outlink descriptor's address.*/
            uint32_t outlink_stop_ch0:    1;                  /*Set this bit to stop dealing with the outlink descriptors.*/
            uint32_t outlink_start_ch0:   1;                  /*Set this bit to start dealing with the outlink descriptors.*/
            uint32_t outlink_restart_ch0: 1;                  /*Set this bit to restart a new outlink from the last address.*/
            uint32_t outlink_park_ch0:    1;                  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
            uint32_t reserved24:          8;
        };
        uint32_t val;
    } out_link_ch0;
    union {
        struct {
            uint32_t outlink_addr_ch1:   20;                  /*This register stores the 20 least significant bits of the first outlink descriptor's address.*/
            uint32_t outlink_stop_ch1:    1;                  /*Set this bit to stop dealing with the outlink descriptors.*/
            uint32_t outlink_start_ch1:   1;                  /*Set this bit to start dealing with the outlink descriptors.*/
            uint32_t outlink_restart_ch1: 1;                  /*Set this bit to restart a new outlink from the last address.*/
            uint32_t outlink_park_ch1:    1;                  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
            uint32_t reserved24:          8;
        };
        uint32_t val;
    } out_link_ch1;
    union {
        struct {
            uint32_t outlink_addr_ch2:   20;                  /*This register stores the 20 least significant bits of the first outlink descriptor's address.*/
            uint32_t outlink_stop_ch2:    1;                  /*Set this bit to stop dealing with the outlink descriptors.*/
            uint32_t outlink_start_ch2:   1;                  /*Set this bit to start dealing with the outlink descriptors.*/
            uint32_t outlink_restart_ch2: 1;                  /*Set this bit to restart a new outlink from the last address.*/
            uint32_t outlink_park_ch2:    1;                  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
            uint32_t reserved24:          8;
        };
        uint32_t val;
    } out_link_ch2;
    union {
        struct {
            uint32_t outlink_addr_ch3:   20;                  /*This register stores the 20 least significant bits of the first outlink descriptor's address.*/
            uint32_t outlink_stop_ch3:    1;                  /*Set this bit to stop dealing with the outlink descriptors.*/
            uint32_t outlink_start_ch3:   1;                  /*Set this bit to start dealing with the outlink descriptors.*/
            uint32_t outlink_restart_ch3: 1;                  /*Set this bit to restart a new outlink from the last address.*/
            uint32_t outlink_park_ch3:    1;                  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
            uint32_t reserved24:          8;
        };
        uint32_t val;
    } out_link_ch3;
    union {
        struct {
            uint32_t outlink_addr_ch4:   20;                  /*This register stores the 20 least significant bits of the first outlink descriptor's address.*/
            uint32_t outlink_stop_ch4:    1;                  /*Set this bit to stop dealing with the outlink descriptors.*/
            uint32_t outlink_start_ch4:   1;                  /*Set this bit to start dealing with the outlink descriptors.*/
            uint32_t outlink_restart_ch4: 1;                  /*Set this bit to restart a new outlink from the last address.*/
            uint32_t outlink_park_ch4:    1;                  /*1: the outlink descriptor's FSM is in idle state.  0: the outlink descriptor's FSM is working.*/
            uint32_t reserved24:          8;
        };
        uint32_t val;
    } out_link_ch4;
    union {
        struct {
            uint32_t inlink_addr_ch0:    20;                  /*This register stores the 20 least significant bits of the first inlink descriptor's address.*/
            uint32_t inlink_auto_ret_ch0: 1;                  /*Set this bit to return to current inlink descriptor's address  when there are some errors in current receiving data.*/
            uint32_t inlink_stop_ch0:     1;                  /*Set this bit to stop dealing with the inlink descriptors.*/
            uint32_t inlink_start_ch0:    1;                  /*Set this bit to start dealing with the inlink descriptors.*/
            uint32_t inlink_restart_ch0:  1;                  /*Set this bit to mount a new inlink descriptor.*/
            uint32_t inlink_park_ch0:     1;                  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
            uint32_t reserved25:          7;
        };
        uint32_t val;
    } in_link_ch0;
    union {
        struct {
            uint32_t inlink_addr_ch1:    20;                  /*This register stores the 20 least significant bits of the first inlink descriptor's address.*/
            uint32_t inlink_auto_ret_ch1: 1;                  /*Set this bit to return to current inlink descriptor's address  when there are some errors in current receiving data.*/
