espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_struct.h
            uint32_t inlink_stop_ch1:     1;                  /*Set this bit to stop dealing with the inlink descriptors.*/
            uint32_t inlink_start_ch1:    1;                  /*Set this bit to start dealing with the inlink descriptors.*/
            uint32_t inlink_restart_ch1:  1;                  /*Set this bit to mount a new inlink descriptor.*/
            uint32_t inlink_park_ch1:     1;                  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
            uint32_t reserved25:          7;
        };
        uint32_t val;
    } in_link_ch1;
    union {
        struct {
            uint32_t inlink_addr_ch2:    20;                  /*This register stores the 20 least significant bits of the first inlink descriptor's address.*/
            uint32_t inlink_auto_ret_ch2: 1;                  /*Set this bit to return to current inlink descriptor's address  when there are some errors in current receiving data.*/
            uint32_t inlink_stop_ch2:     1;                  /*Set this bit to stop dealing with the inlink descriptors.*/
            uint32_t inlink_start_ch2:    1;                  /*Set this bit to start dealing with the inlink descriptors.*/
            uint32_t inlink_restart_ch2:  1;                  /*Set this bit to mount a new inlink descriptor.*/
            uint32_t inlink_park_ch2:     1;                  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
            uint32_t reserved25:          7;
        };
        uint32_t val;
    } in_link_ch2;
    union {
        struct {
            uint32_t inlink_addr_ch3:    20;                  /*This register stores the 20 least significant bits of the first inlink descriptor's address.*/
            uint32_t inlink_auto_ret_ch3: 1;                  /*Set this bit to return to current inlink descriptor's address  when there are some errors in current receiving data.*/
            uint32_t inlink_stop_ch3:     1;                  /*Set this bit to stop dealing with the inlink descriptors.*/
            uint32_t inlink_start_ch3:    1;                  /*Set this bit to start dealing with the inlink descriptors.*/
            uint32_t inlink_restart_ch3:  1;                  /*Set this bit to mount a new inlink descriptor.*/
            uint32_t inlink_park_ch3:     1;                  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
            uint32_t reserved25:          7;
        };
        uint32_t val;
    } in_link_ch3;
    union {
        struct {
            uint32_t inlink_addr_ch4:    20;                  /*This register stores the 20 least significant bits of the first inlink descriptor's address.*/
            uint32_t inlink_auto_ret_ch4: 1;                  /*Set this bit to return to current inlink descriptor's address  when there are some errors in current receiving data.*/
            uint32_t inlink_stop_ch4:     1;                  /*Set this bit to stop dealing with the inlink descriptors.*/
            uint32_t inlink_start_ch4:    1;                  /*Set this bit to start dealing with the inlink descriptors.*/
            uint32_t inlink_restart_ch4:  1;                  /*Set this bit to mount a new inlink descriptor.*/
            uint32_t inlink_park_ch4:     1;                  /*1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is working.*/
            uint32_t reserved25:          7;
        };
        uint32_t val;
    } in_link_ch4;
    union {
        struct {
            uint32_t inlink_dscr_addr_ch0: 18;                /*This register stores the current inlink descriptor's address.*/
            uint32_t in_dscr_state_ch0:    2;                 /*reserved*/
            uint32_t in_state_ch0:         3;                 /*reserved*/
            uint32_t reserved23:           9;                 /*reserved*/
        };
        uint32_t val;
    } in_state_ch0;
    union {
        struct {
            uint32_t inlink_dscr_addr_ch1: 18;                /*This register stores the current inlink descriptor's address.*/
            uint32_t in_dscr_state_ch1:    2;                 /*reserved*/
            uint32_t in_state_ch1:         3;                 /*reserved*/
            uint32_t reserved23:           9;                 /*reserved*/
        };
        uint32_t val;
    } in_state_ch1;
    union {
        struct {
            uint32_t inlink_dscr_addr_ch2: 18;                /*This register stores the current inlink descriptor's address.*/
            uint32_t in_dscr_state_ch2:    2;                 /*reserved*/
            uint32_t in_state_ch2:         3;                 /*reserved*/
            uint32_t reserved23:           9;                 /*reserved*/
        };
        uint32_t val;
    } in_state_ch2;
    union {
        struct {
            uint32_t inlink_dscr_addr_ch3: 18;                /*This register stores the current inlink descriptor's address.*/
            uint32_t in_dscr_state_ch3:    2;                 /*reserved*/
            uint32_t in_state_ch3:         3;                 /*reserved*/
            uint32_t reserved23:           9;                 /*reserved*/
        };
        uint32_t val;
    } in_state_ch3;
    union {
        struct {
            uint32_t inlink_dscr_addr_ch4: 18;                /*This register stores the current inlink descriptor's address.*/
            uint32_t in_dscr_state_ch4:    2;                 /*reserved*/
            uint32_t in_state_ch4:         3;                 /*reserved*/
            uint32_t reserved23:           9;                 /*reserved*/
        };
        uint32_t val;
    } in_state_ch4;
    union {
        struct {
            uint32_t outlink_dscr_addr_ch0: 18;               /*This register stores the current outlink descriptor's address.*/
            uint32_t out_dscr_state_ch0:    2;                /*reserved*/
            uint32_t out_state_ch0:         3;                /*reserved*/
            uint32_t reserved23:            9;                /*reserved*/
        };
        uint32_t val;
    } out_state_ch0;
    union {
        struct {
            uint32_t outlink_dscr_addr_ch1: 18;               /*This register stores the current outlink descriptor's address.*/
            uint32_t out_dscr_state_ch1:    2;                /*reserved*/
            uint32_t out_state_ch1:         3;                /*reserved*/
            uint32_t reserved23:            9;                /*reserved*/
        };
        uint32_t val;
    } out_state_ch1;
    union {
        struct {
            uint32_t outlink_dscr_addr_ch2: 18;               /*This register stores the current outlink descriptor's address.*/
            uint32_t out_dscr_state_ch2:    2;                /*reserved*/
            uint32_t out_state_ch2:         3;                /*reserved*/
            uint32_t reserved23:            9;                /*reserved*/
        };
        uint32_t val;
    } out_state_ch2;
    union {
        struct {
            uint32_t outlink_dscr_addr_ch3: 18;               /*This register stores the current outlink descriptor's address.*/
            uint32_t out_dscr_state_ch3:    2;                /*reserved*/
            uint32_t out_state_ch3:         3;                /*reserved*/
            uint32_t reserved23:            9;                /*reserved*/
        };
        uint32_t val;
    } out_state_ch3;
    union {
        struct {
            uint32_t outlink_dscr_addr_ch4: 18;               /*This register stores the current outlink descriptor's address.*/
            uint32_t out_dscr_state_ch4:    2;                /*reserved*/
            uint32_t out_state_ch4:         3;                /*reserved*/
            uint32_t reserved23:            9;                /*reserved*/
        };
        uint32_t val;
    } out_state_ch4;
    uint32_t out_eof_des_addr_ch0;                            /*This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t out_eof_des_addr_ch1;                            /*This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t out_eof_des_addr_ch2;                            /*This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t out_eof_des_addr_ch3;                            /*This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t out_eof_des_addr_ch4;                            /*This register stores the address of the outlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_suc_eof_des_addr_ch0;                         /*This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_suc_eof_des_addr_ch1;                         /*This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_suc_eof_des_addr_ch2;                         /*This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_suc_eof_des_addr_ch3;                         /*This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_suc_eof_des_addr_ch4;                         /*This register stores the address of the inlink descriptor when the EOF bit in this descriptor is 1.*/
    uint32_t in_err_eof_des_addr_ch0;                         /*This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
    uint32_t in_err_eof_des_addr_ch1;                         /*This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
    uint32_t in_err_eof_des_addr_ch2;                         /*This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
    uint32_t in_err_eof_des_addr_ch3;                         /*This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
    uint32_t in_err_eof_des_addr_ch4;                         /*This register stores the address of the inlink descriptor when there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
    uint32_t out_eof_bfr_des_addr_ch0;                        /*This register stores the address of the outlink descriptor before the last outlink descriptor.*/
    uint32_t out_eof_bfr_des_addr_ch1;                        /*This register stores the address of the outlink descriptor before the last outlink descriptor.*/
    uint32_t out_eof_bfr_des_addr_ch2;                        /*This register stores the address of the outlink descriptor before the last outlink descriptor.*/
    uint32_t out_eof_bfr_des_addr_ch3;                        /*This register stores the address of the outlink descriptor before the last outlink descriptor.*/
    uint32_t out_eof_bfr_des_addr_ch4;                        /*This register stores the address of the outlink descriptor before the last outlink descriptor.*/
    union {
        struct {
            uint32_t ahb_testmode: 3;                         /*reserved*/
            uint32_t reserved3:    1;                         /*reserved*/
            uint32_t ahb_testaddr: 2;                         /*reserved*/
            uint32_t reserved6:   26;                         /*reserved*/
        };
        uint32_t val;
    } ahb_test;
    uint32_t in_dscr_ch0;                                     /*The address of the current inlink descriptor x.*/
    uint32_t in_dscr_ch1;                                     /*The address of the current inlink descriptor x.*/
    uint32_t in_dscr_ch2;                                     /*The address of the current inlink descriptor x.*/
    uint32_t in_dscr_ch3;                                     /*The address of the current inlink descriptor x.*/
    uint32_t in_dscr_ch4;                                     /*The address of the current inlink descriptor x.*/
    uint32_t in_dscr_bf0_ch0;                                 /*The address of the last inlink descriptor x-1.*/
    uint32_t in_dscr_bf0_ch1;                                 /*The address of the last inlink descriptor x-1.*/
    uint32_t in_dscr_bf0_ch2;                                 /*The address of the last inlink descriptor x-1.*/
    uint32_t in_dscr_bf0_ch3;                                 /*The address of the last inlink descriptor x-1.*/
    uint32_t in_dscr_bf0_ch4;                                 /*The address of the last inlink descriptor x-1.*/
    uint32_t in_dscr_bf1_ch0;                                 /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t in_dscr_bf1_ch1;                                 /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t in_dscr_bf1_ch2;                                 /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t in_dscr_bf1_ch3;                                 /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t in_dscr_bf1_ch4;                                 /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t out_dscr_ch0;                                    /*The address of the current outlink descriptor y.*/
    uint32_t out_dscr_ch1;                                    /*The address of the current outlink descriptor y.*/
    uint32_t out_dscr_ch2;                                    /*The address of the current outlink descriptor y.*/
    uint32_t out_dscr_ch3;                                    /*The address of the current outlink descriptor y.*/
    uint32_t out_dscr_ch4;                                    /*The address of the current outlink descriptor y.*/
    uint32_t out_dscr_bf0_ch0;                                /*The address of the last outlink descriptor y-1.*/
    uint32_t out_dscr_bf0_ch1;                                /*The address of the last outlink descriptor y-1.*/
    uint32_t out_dscr_bf0_ch2;                                /*The address of the last outlink descriptor y-1.*/
    uint32_t out_dscr_bf0_ch3;                                /*The address of the last outlink descriptor y-1.*/
    uint32_t out_dscr_bf0_ch4;                                /*The address of the last outlink descriptor y-1.*/
    uint32_t out_dscr_bf1_ch0;                                /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t out_dscr_bf1_ch1;                                /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t out_dscr_bf1_ch2;                                /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t out_dscr_bf1_ch3;                                /*The address of the second-to-last inlink descriptor x-2.*/
    uint32_t out_dscr_bf1_ch4;                                /*The address of the second-to-last inlink descriptor x-2.*/
    union {
        struct {
            uint32_t reserved0:    4;                         /*reserved*/
            uint32_t ram_force_pd: 1;                         /*power down*/
            uint32_t ram_force_pu: 1;
            uint32_t ram_clk_fo:   1;                         /*1: Force to open the clock and bypass the gate-clock when accessing the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.*/
            uint32_t reserved7:   25;                         /*reserved*/
        };
        uint32_t val;
    } pd_conf;
    union {
        struct {
            uint32_t tx_weight_ch0: 4;                        /*The weight of Tx channel 0.*/
            uint32_t rx_weight_ch0: 4;                        /*The weight of Rx channel 0.*/
            uint32_t reserved8:    24;
        };
        uint32_t val;
    } wight_ch0;
    union {
        struct {
            uint32_t tx_weight_ch1: 4;                        /*The weight of Tx channel 1.*/
            uint32_t rx_weight_ch1: 4;                        /*The weight of Rx channel 1.*/
            uint32_t reserved8:    24;
        };
        uint32_t val;
    } wight_ch1;
    union {
        struct {
            uint32_t tx_weight_ch2: 4;                        /*The weight of Tx channel 2.*/
            uint32_t rx_weight_ch2: 4;                        /*The weight of Rx channel 2.*/
            uint32_t reserved8:    24;
        };
        uint32_t val;
    } wight_ch2;
    union {
        struct {
            uint32_t tx_weight_ch3: 4;                        /*The weight of Tx channel 3.*/
            uint32_t rx_weight_ch3: 4;                        /*The weight of Rx channel 3.*/
            uint32_t reserved8:    24;
        };
        uint32_t val;
    } wight_ch3;
    union {
        struct {
            uint32_t tx_weight_ch4: 4;                        /*The weight of Tx channel 4.*/
            uint32_t rx_weight_ch4: 4;                        /*The weight of Rx channel 4.*/
            uint32_t reserved8:    24;
        };
        uint32_t val;
    } wight_ch4;
    union {
        struct {
            uint32_t tx_pri_ch0: 4;                           /*The priority of Tx channel 0. The larger of the value  the higher of the priority.*/
            uint32_t rx_pri_ch0: 4;                           /*The priority of Rx channel 0. The larger of the value  the higher of the priority.*/
            uint32_t reserved8: 24;
        };
        uint32_t val;
    } pri_ch0;
    union {
        struct {
            uint32_t tx_pri_ch1: 4;                           /*The priority of Tx channel 1. The larger of the value  the higher of the priority.*/
            uint32_t rx_pri_ch1: 4;                           /*The priority of Rx channel 1. The larger of the value  the higher of the priority.*/
            uint32_t reserved8: 24;
        };
        uint32_t val;
    } pri_ch1;
    union {
        struct {
            uint32_t tx_pri_ch2: 4;                           /*The priority of Tx channel 2. The larger of the value  the higher of the priority.*/
            uint32_t rx_pri_ch2: 4;                           /*The priority of Rx channel 2. The larger of the value  the higher of the priority.*/
            uint32_t reserved8: 24;
        };
        uint32_t val;
    } pri_ch2;
    union {
        struct {
            uint32_t tx_pri_ch3: 4;                           /*The priority of Tx channel 3. The larger of the value  the higher of the priority.*/
            uint32_t rx_pri_ch3: 4;                           /*The priority of Rx channel 3. The larger of the value  the higher of the priority.*/
            uint32_t reserved8: 24;
        };
        uint32_t val;
    } pri_ch3;
    union {
        struct {
            uint32_t tx_pri_ch4: 4;                           /*The priority of Tx channel 4. The larger of the value  the higher of the priority.*/
            uint32_t rx_pri_ch4: 4;                           /*The priority of Rx channel 4. The larger of the value  the higher of the priority.*/
            uint32_t reserved8: 24;
        };
        uint32_t val;
    } pri_ch4;
    union {
        struct {
            uint32_t ahbm_rst_inter: 1;                       /*Set this bit  then clear this bit to reset the internal ahb FSM.*/
            uint32_t ahbm_rst_exter: 1;                       /*Set this bit  then clear this bit to reset the external ahb FSM.*/
            uint32_t arb_pri_dis:    1;                       /*Set this bit to disable priority arbitration function.*/
            uint32_t clk_en:         1;
            uint32_t reserved4:     28;
        };
        uint32_t val;
    } misc_conf;
    union {
        struct {
            uint32_t peri_in_sel_ch0:  6;                     /*This register is used to select peripheral for Rx channel 0. 0:SPI2*/
            uint32_t peri_out_sel_ch0: 6;                     /*This register is used to select peripheral for Tx channel 0. 0:SPI2*/
            uint32_t reserved12:      20;
        };
        uint32_t val;
    } peri_sel_ch0;
    union {
        struct {
            uint32_t peri_in_sel_ch1:  6;                     /*This register is used to select peripheral for Rx channel 1. 0:SPI2*/
            uint32_t peri_out_sel_ch1: 6;                     /*This register is used to select peripheral for Tx channel 1. 0:SPI2*/
            uint32_t reserved12:      20;
        };
        uint32_t val;
    } peri_sel_ch1;
    union {
        struct {
            uint32_t peri_in_sel_ch2:  6;                     /*This register is used to select peripheral for Rx channel 2. 0:SPI2*/
            uint32_t peri_out_sel_ch2: 6;                     /*This register is used to select peripheral for Tx channel 2. 0:SPI2*/
            uint32_t reserved12:      20;
        };
        uint32_t val;
    } peri_sel_ch2;
    union {
        struct {
            uint32_t peri_in_sel_ch3:  6;                     /*This register is used to select peripheral for Rx channel 3. 0:SPI2*/
            uint32_t peri_out_sel_ch3: 6;                     /*This register is used to select peripheral for Tx channel 3. 0:SPI2*/
            uint32_t reserved12:      20;
        };
        uint32_t val;
    } peri_sel_ch3;
    union {
        struct {
            uint32_t peri_in_sel_ch4:  6;                     /*This register is used to select peripheral for Rx channel 4. 0:SPI2*/
            uint32_t peri_out_sel_ch4: 6;                     /*This register is used to select peripheral for Tx channel 4. 0:SPI2*/
            uint32_t reserved12:      20;
        };
        uint32_t val;
    } peri_sel_ch4;
    union {
        struct {
            uint32_t in_size_ch0:  5;                         /*This register is used to configure the size of L2 Rx FIFO for Rx channel 0. 0:16 bytes*/
            uint32_t out_size_ch0: 5;                         /*This register is used to configure the size of L2 Tx FIFO for Tx channel 0. 0:16 bytes*/
            uint32_t reserved10:  22;
        };
        uint32_t val;
    } sram_size_ch0;
    union {
        struct {
            uint32_t in_size_ch1:  5;                         /*This register is used to configure the size of L2 Rx FIFO for Rx channel 1. 0:16 bytes*/
            uint32_t out_size_ch1: 5;                         /*This register is used to configure the size of L2 Tx FIFO for Tx channel 1. 0:16 bytes*/
            uint32_t reserved10:  22;
        };
        uint32_t val;
    } sram_size_ch1;
    union {
        struct {
            uint32_t in_size_ch2:  5;                         /*This register is used to configure the size of L2 Rx FIFO for Rx channel 2. 0:16 bytes*/
            uint32_t out_size_ch2: 5;                         /*This register is used to configure the size of L2 Tx FIFO for Tx channel 2. 0:16 bytes*/
            uint32_t reserved10:  22;
        };
        uint32_t val;
    } sram_size_ch2;
    union {
        struct {
            uint32_t in_size_ch3:  5;                         /*This register is used to configure the size of L2 Rx FIFO for Rx channel 3. 0:16 bytes*/
            uint32_t out_size_ch3: 5;                         /*This register is used to configure the size of L2 Tx FIFO for Tx channel 3. 0:16 bytes*/
            uint32_t reserved10:  22;
        };
        uint32_t val;
    } sram_size_ch3;
    union {
        struct {
            uint32_t in_size_ch4:  5;                         /*This register is used to configure the size of L2 Rx FIFO for Rx channel 4. 0:16 bytes*/
            uint32_t out_size_ch4: 5;                         /*This register is used to configure the size of L2 Tx FIFO for Tx channel 4. 0:16 bytes*/
            uint32_t reserved10:  22;
        };
        uint32_t val;
    } sram_size_ch4;
    uint32_t date;                                            /*register version.*/
} dma_dev_t;

extern dma_dev_t DMA;

#ifdef __cplusplus
}
#endif
